[AdvGeneralM1 X2CharacterTemplate]
strCharacterName="General"

[AdvGeneralM2 X2CharacterTemplate]
strCharacterName="Advanced General"

[AdvGeneralM3 X2CharacterTemplate]
strCharacterName="Elite General"

[AdvGeneralM2B X2CharacterTemplate]
strCharacterName="Royal Sovereign"

[AdvGeneralM3B X2CharacterTemplate]
strCharacterName="Royal Sovereign"

[AdvHonorGuardM2 X2CharacterTemplate]
strCharacterName="Honor Guard"

[AdvHonorGuardM3 X2CharacterTemplate]
strCharacterName="Elite Honor Guard"

[AdvHonorGuardLMGM3 X2CharacterTemplate]
strCharacterName="Elite Honor Guard"

[AdvHonorGuardSwordM2 X2WeaponTemplate]
FriendlyName="Advent Laser Saber"

[AdvHonorGuardSwordM3 X2WeaponTemplate]
FriendlyName="Advent Laser Saber"

[AdvGeneralLaserM2_WPN X2WeaponTemplate]
FriendlyName="Advent Laser Rifle"
FriendlyNamePlural="Advent Laser Rifles"
BriefSummary="The ADVENT laser rifle is the next step in state of the art ADVENT tech. ADVENT laser tech boost damage output with much less recoil for better pin point aiming."
TacticalText="<Bullet/> ADVENT laser rifles are more powerful than the traditional mag weapons.\n<Bullet/> Less recoil for pin point aiming."
AbilityDescName="assault rifle"

[AdvGeneralLaserM3_WPN X2WeaponTemplate]
FriendlyName="Advent Laser Rifle"
FriendlyNamePlural="Advent Laser Rifles"
BriefSummary="The ADVENT laser rifle is the next step in state of the art ADVENT tech. ADVENT laser tech boost damage output with much less recoil for better pin point aiming."
TacticalText="<Bullet/> ADVENT laser rifles are more powerful than the traditional mag weapons.\n<Bullet/> Less recoil for pin point aiming."
AbilityDescName="assault rifle"

[AdvLaserRifleM2_WPN X2WeaponTemplate]
FriendlyName="Advent Laser Rifle"
FriendlyNamePlural="Advent Laser Rifles"
BriefSummary="The ADVENT laser rifle is the next step in state of the art ADVENT tech. ADVENT laser tech boost damage output with much less recoil for better pin point aiming."
TacticalText="<Bullet/> ADVENT laser rifles are more powerful than the traditional mag weapons.\n<Bullet/> Less recoil for pin point aiming."
AbilityDescName="assault rifle"

[AdvLaserRifleM3_WPN X2WeaponTemplate]
FriendlyName="Advent Laser Rifle"
FriendlyNamePlural="Advent Laser Rifles"
BriefSummary="The ADVENT laser rifle is the next step in state of the art ADVENT tech. ADVENT laser tech boost damage output with much less recoil for better pin point aiming."
TacticalText="<Bullet/> ADVENT laser rifles are more powerful than the traditional mag weapons.\n<Bullet/> Less recoil for pin point aiming."
AbilityDescName="assault rifle"

[AdvLaserLMGM3_WPN X2WeaponTemplate]
FriendlyName="Advent Laser Cannon"
FriendlyNamePlural="Advent Laser Cannons"
BriefSummary="The ADVENT laser Cannon is the next step in state of the art ADVENT tech. ADVENT laser tech boost damage output with much less recoil for better pin point aiming."
TacticalText="<Bullet/> ADVENT laser Cannons are more powerful than the traditional mag weapons.\n<Bullet/> Less recoil for pin point aiming."
AbilityDescName="cannon"

[AdvGeneralPistolM1_WPN X2WeaponTemplate]
FriendlyName="Advent General Pistol"
FriendlyNamePlural="Advent General Pistols"
BriefSummary="The ADVENT General's sidearm, this pistol integrates a higher Alien tech level. A mag weapon with beam-like power."
TacticalText="<Bullet/> ADVENT General pistols are one of the most powerful handguns Advent has.\n<Bullet/> Can be fired with a single action."
AbilityDescName="pistol"

[AdvGeneralPistolM2_WPN X2WeaponTemplate]
FriendlyName="Advent General Pistol"
FriendlyNamePlural="Advent General Pistols"
BriefSummary="The ADVENT General's sidearm, this pistol integrates a higher Alien tech level. A mag weapon with beam-like power."
TacticalText="<Bullet/> ADVENT General pistols are one of the most powerful handguns Advent has.\n<Bullet/> Can be fired with a single action."
AbilityDescName="pistol"

[AdvGeneralPistolM3_WPN X2WeaponTemplate]
FriendlyName="Advent General Pistol"
FriendlyNamePlural="Advent General Pistols"
BriefSummary="The ADVENT General's sidearm, this pistol integrates a higher Alien tech level. A mag weapon with beam-like power."
TacticalText="<Bullet/> ADVENT General pistols are one of the most powerful handguns Advent has.\n<Bullet/> Can be fired with a single action."
AbilityDescName="pistol"

[GoldenPistol_WPN X2WeaponTemplate]
FriendlyName="<font color='#E1C20D'>Advent Golden Pistol</font>"
FriendlyNamePlural="<font color='#E1C20D'>Advent Golden Pistols</font>"
BriefSummary="The ADVENT model number NEKO-90 GOLDEN sidearm is a pistol that integrates a higher Alien tech level. It's a mag weapon with beam-like power."
TacticalText="<Bullet/> ADVENT General pistols are one of the most powerful handguns Advent has.\n<Bullet/> Can be fired with a single action, boost aim and to crit chance.\n<Bullet/> Rare and highly sought after by those in the Black Market."
AbilityDescName="pistol"


[CallAdvReinforcementsM1 X2AbilityTemplate]
LocFriendlyName="Advent Reinforcements"
LocLongDescription="Calls in Advent Reinforcements."
LocHelpText="Call Advent Reinforcements."
LocFlyOverText="I need reinforcements now!"

[CallAdvReinforcementsM2 X2AbilityTemplate]
LocFriendlyName="Advent Reinforcements"
LocLongDescription="Calls in Advent Reinforcements."
LocHelpText="Call Advent Reinforcements."
LocFlyOverText="I need reinforcements now!"

[CallAdvReinforcementsM3 X2AbilityTemplate]
LocFriendlyName="Advent Reinforcements"
LocLongDescription="Calls in Advent Reinforcements."
LocHelpText="Call Advent Reinforcements."
LocFlyOverText="I need reinforcements now!"

[CallAdvReinforcementsM2B X2AbilityTemplate]
LocFriendlyName="Advent Honor Guard Reinforcements"
LocLongDescription="Calls in Advent Honor Guard Reinforcements."
LocHelpText="Call Advent Honor Guard."
LocFlyOverText="Drop in the Guard!"

[CallAdvReinforcementsM3B X2AbilityTemplate]
LocFriendlyName="Advent Honor Guard Reinforcements"
LocLongDescription="Calls in Advent Honor Guard Reinforcements."
LocHelpText="Call Advent Honor Guard."
LocFlyOverText="Drop in the Guard!"

[GeneralM1Buff X2AbilityTemplate]
LocFriendlyName="Gereral's Rally Cry"
LocLongDescription="The Advent General's Rally Cry will buff all Advent near by. Grants +10 Defense and +10 Will. Lasts 2 turns."
LocHelpText="The Advent General's Rally Cry will buff all Advent near by. Grants +10 Defense and +10 Will. Lasts 2 turns."
LocFlyOverText="The Elders demand your loyalty!! Stand and fight!!"

[GeneralM2Buff X2AbilityTemplate]
LocFriendlyName="Gereral's Rally Cry"
LocLongDescription="The Advent General's Rally Cry will buff all Advent near by. Grants +10 Defense, +10 Will and +5 Offense. Lasts 2 turns."
LocHelpText="The Advent General's Rally Cry will buff all Advent near by. Grants +10 Defense, +10 Will and +5 Offense. Lasts 2 turns."
LocFlyOverText="The Elders demand your loyalty!! Stand and fight!!"

[GeneralM3Buff X2AbilityTemplate]
LocFriendlyName="Gereral's Rally Cry"
LocLongDescription="The Advent General's Rally Cry will buff all Advent near by. Grants +10 Defense, +10 Will, +5 Offense and +2 Mobility. Lasts 2 turns."
LocHelpText="The Advent General's Rally Cry will buff all Advent near by. Grants +10 Defense, +10 Will, +5 Offense, and +2 Mobility. Lasts 2 turns."
LocFlyOverText="The Elders demand your loyalty!! Stand and fight!!"

[HGDemolitionShot X2AbilityTemplate]
LocFriendlyName="Demolition Shot"
LocLongDescription="Unleash a volley at your target's cover, significantly damaging or destroying it. Deals no damage to your target."
LocHelpText="Fire at your target's cover, significantly damaging or destroying it. Deals no damage to your target."
LocFlyOverText="Demolition Shot"
LocPromotionPopupText="<Bullet/> Demolition Shot requires <Ability:SelfAmmoCost/> ammo points and has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Demolition Shot does increased environmental damage, and will destroy most cover objects.<br/>"
LocMissMessage="Missed!"

[HonorGuardLaserSlash X2AbilityTemplate]
LocFriendlyName="Laser Slash"
LocLongDescription="Slashes a target dealing fire damage that will add burning effects as well disorientation effects to a single target."
LocHelpText="Slash at a single target."
LocFlyOverText="Slash at target."


